Natnatee/CH32V003F4P6_REMOTE/src/main.c
#include "ch32fun.h"
#include <string.h>
#include "ssd1306.h"
#include "keypad.h"
#include "ir_recv.h"
#include "ir_send.h"
#include "flash_storage.h"
#include "ir_database.h"
#include "tetris.h"
#include "flappy.h"
#include "calc.h"

// 7 โหมดการทำงาน (รวม TETRIS, BIRD และ CALC)
typedef enum {
    MODE_SEND = 0,
    MODE_LEARN = 1,
    MODE_NEW = 2,
    MODE_RENAME = 3,
    MODE_TETRIS = 4,
    MODE_BIRD = 5,
    MODE_CALC = 6
} RemoteMode;

static const char *mode_names[7] = {
    "SEND",
    "LRN ",
    "NEW ",
    "NAME",
    "TETR",
    "BIRD",
    "CALC"
};

static const char *mode_select_labels[7] = {
    "[ SEND ]",
    "[ LEARN ]",
    "[  NEW  ]",
    "[ RENAME ]",
    "[ TETRIS ]",
    "[  BIRD  ]",
    "[  CALC  ]"
};

// บัฟเฟอร์ใน RAM สำหรับถือเฉพาะโปรไฟล์ปัจจุบันที่กำลังใช้งาน (12 ปุ่ม = 48 ไบต์เท่านั้น!)
static uint32_t active_codes[12];
static char current_profile_name[8];

// แปลงหมายเลขปุ่ม (1..15) เป็น Index ในตาราง (0..11)
static int key_to_index(uint8_t key) {
    switch (key) {
        case 1:  return 0;  // 1: ON / Power
        case 2:  return 1;  // 2: UP
        case 3:  return 2;  // 3: OFF / MUTE
        case 5:  return 3;  // 5: LEFT
        case 6:  return 4;  // 6: OK
        case 7:  return 5;  // 7: RIGHT
        case 9:  return 6;  // 9: BACK
        case 10: return 7;  // 10: DOWN
        case 11: return 8;  // 11: HOME / MENU
        case 13: return 9;  // 13: INPUT / SOURCE
        case 14: return 10; // 14: VOL-
        case 15: return 11; // 15: VOL+
        default: return -1;
    }
}

// ตารางตัวอักษรสำหรับปุ่ม 1..15 ในโหมด RENAME
static const char *key_letters[12] = {
    "AB",       // Key 1
    "CD",       // Key 2
    "EF",       // Key 3
    "GH",       // Key 5
    "IJ",       // Key 6
    "KL",       // Key 7
    "MN",       // Key 9
    "OP",       // Key 10
    "QR",       // Key 11
    "ST",       // Key 13
    "UV",       // Key 14
    "WXYZ "     // Key 15 (มี Space/ลบ)
};

// สร้างข้อความ Footer ปกติ เช่น "SEND 05/16"
static void get_footer_str(char *buf, RemoteMode mode, uint8_t profile_idx) {
    uint8_t p_num = profile_idx + 1;
    const char *m_str = mode_names[mode];

    buf[0] = m_str[0];
    buf[1] = m_str[1];
    buf[2] = m_str[2];
    buf[3] = m_str[3];
    buf[4] = ' ';
    buf[5] = '0' + (p_num / 10);
    buf[6] = '0' + (p_num % 10);
    buf[7] = '/';
    buf[8] = '1';
    buf[9] = '6';
    buf[10] = '\0';
}

int main()
{
    // 1. กำหนดค่า Core Clock 48MHz
    SystemInit();

    // Safety Delay
    Delay_Ms(200);

    // 2. เริ่มต้นฮาร์ดแวร์ OLED, Keypad, Flash Storage, IR RX & IR TX
    ssd1306_init();
    keypad_init();
    flash_storage_init();
    ir_recv_init();
    ir_send_init();

    // ตัวแปรสถานะระบบ
    RemoteMode current_mode = MODE_SEND;
    RemoteMode selected_mode = MODE_SEND;
    uint8_t current_profile = 0; // 0 = Profile 01
    uint8_t mode_select_active = 0;

    // โหลดข้อมูลปุ่มและชื่อของ Profile 01 จาก Flash ROM เข้าสู่ RAM
    flash_load_profile(current_profile, active_codes, current_profile_name);

    // ตัวแปรสำหรับโหมด LEARN
    uint8_t ir_captured = 0;
    uint32_t captured_code = 0;

    // ตัวแปรสำหรับโหมด NEW (Brute-Force Generator)
    uint16_t new_brute_idx = 0;
    uint8_t new_preview_active = 0;
    uint32_t new_preview_ticks = 0;

    // ตัวแปรสำหรับโหมด RENAME
    uint8_t rename_editing = 0;
    uint8_t rename_cursor = 0;
    char edit_name_buf[8] = {0};

    char footer_buf[16];
    get_footer_str(footer_buf, current_mode, current_profile);
    oled_render_grid_screen(current_profile_name, footer_buf, 0, 0, active_codes);

    uint8_t last_key = 0;
    uint8_t row = 0, col = 0;
    uint32_t blink_tick = 0;
    uint8_t mode_blink_state = 1;

    while (1)
    {
        // --- 0.1 โหมดพิเศษ: TETRIS GAME ---
        if (current_mode == MODE_TETRIS && !mode_select_active)
        {
            uint8_t key = keypad_scan(&row, &col);
            uint8_t is_new = (key != 0 && key != last_key);
            if (key != 0) {
                last_key = key;
                tetris_handle_key(key, is_new);
            } else {
                last_key = 0;
                tetris_handle_key(0, 0);
            }

            if (tetris_should_exit()) {
                current_mode = MODE_SEND;
                get_footer_str(footer_buf, current_mode, current_profile);
                oled_render_grid_screen(current_profile_name, footer_buf, 0, 0, active_codes);
            } else {
                tetris_update();
                tetris_render();
            }

            Delay_Ms(20);
            continue;
        }

        // --- 0.2 โหมดพิเศษ: FLAPPY BIRD GAME ---
        if (current_mode == MODE_BIRD && !mode_select_active)
        {
            uint8_t key = keypad_scan(&row, &col);
            uint8_t is_new = (key != 0 && key != last_key);
            if (key != 0) {
                last_key = key;
                flappy_handle_key(key, is_new);
            } else {
                last_key = 0;
            }

            if (flappy_should_exit()) {
                current_mode = MODE_SEND;
                get_footer_str(footer_buf, current_mode, current_profile);
                oled_render_grid_screen(current_profile_name, footer_buf, 0, 0, active_codes);
            } else {
                flappy_update();
                flappy_render();
            }

            Delay_Ms(20);
            continue;
        }

        // --- 0.3 โหมดพิเศษ: CALCULATOR ---
        if (current_mode == MODE_CALC && !mode_select_active)
        {
            uint8_t key = keypad_scan(&row, &col);
            if (key != 0 && key != last_key) {
                last_key = key;
                calc_handle_key(key);
                calc_render();
            } else if (key == 0) {
                last_key = 0;
            }

            if (calc_should_exit()) {
                current_mode = MODE_SEND;
                get_footer_str(footer_buf, current_mode, current_profile);
                oled_render_grid_screen(current_profile_name, footer_buf, 0, 0, active_codes);
            }

